{
  "do you sell iphones": "Yes, we have the latest iPhone models including iPhone 14, 14 Pro, and 14 Pro Max.",
  "what are the best laptops you have": "We offer top laptops like MacBook Air, MacBook Pro, Dell XPS, HP Spectre, and Lenovo ThinkPad.",
  "do you have samsung phones": "Yes, we stock Samsung Galaxy S series, A series, and the Fold series.",
  "what's the price of iphone 14 pro": "The iPhone 14 Pro starts at $999 depending on storage options.",
  "do you offer warranty": "Yes, all our devices come with a 1-year warranty. Extended warranties are also available.",
  "can i return a device": "Yes, you can return a device within 14 days of purchase with the original receipt.",
  "do you have gaming laptops": "Yes, we have gaming laptops from ASUS ROG, Acer Predator, and MSI with high-end specs.",
  "do you sell accessories": "We sell accessories including chargers, cases, headphones, keyboards, and more.",
  "what are your store hours": "Our store is open Monday to Saturday from 9 AM to 8 PM, and Sunday from 10 AM to 6 PM.",
  "do you offer installment plans": "Yes, we offer 6, 12, and 24-month installment plans with zero or low interest rates.",
  "what is the price of iphone 14": "The iPhone 14 starts at $799 for the base model with 128GB storage.",
  "how much is samsung galaxy s23": "The Samsung Galaxy S23 starts at $749 depending on the variant and storage.",
  "what is the ram of iphone 14": "The iPhone 14 comes with 6GB of RAM.",
  "what is the storage capacity of samsung galaxy s23": "The Galaxy S23 offers storage options of 128GB, 256GB, and 512GB.",
  "what is the battery life of iphone 14": "The iPhone 14 can last up to 20 hours of video playback on a full charge.",
  "recommend me a laptop under 1000 dollars": "We recommend the Dell Inspiron 15 or Lenovo IdeaPad 5 – both offer great performance under $1000.",
  "which phone has the best camera": "The iPhone 14 Pro and Samsung Galaxy S23 Ultra are top choices for camera quality.",
  "do you provide repair services": "Yes, we provide repair services for all devices purchased from our shop. Charges may apply for out-of-warranty repairs.",
  "what is the best laptop for gaming": "The ASUS ROG Zephyrus and Dell Alienware series are excellent for gaming, with high-end GPUs and fast refresh rates.",
  "is there emi option available": "Yes, we offer EMI payment options through selected banks and credit card providers.",
  "do you sell used phones": "Yes, we offer certified pre-owned phones that come with a 6-month warranty.",
  "how to transfer data to new phone": "You can use tools like 'Move to iOS' for iPhones or Samsung Smart Switch for Samsung phones to transfer your data.",
  "can i exchange my old phone": "Yes, we offer exchange options. Please visit our shop for a device evaluation and exchange quote.",
  "do you have macbooks": "Yes, we have the latest MacBook Air and MacBook Pro models in stock.",
  "how much is a dell xps 13": "The Dell XPS 13 starts at $999, depending on the processor and RAM configuration.",
  "which is better: iphone or samsung": "Both have strengths – iPhones offer a smooth iOS experience, while Samsung excels in display and camera features.",
  "do you have accessories": "Yes, we stock phone cases, screen protectors, chargers, headphones, and more for all major brands.",
  "what is the best budget phone": "The Samsung Galaxy A14 and iPhone SE are excellent budget-friendly choices with good performance.",
  "can i return a product": "Yes, we offer a 7-day return policy for unused products in original packaging with a valid receipt.",
  "do you have smartwatches": "Yes, we have a range of smartwatches including Apple Watch, Samsung Galaxy Watch, and Fitbit.",
  "what is the price of macbook air": "The MacBook Air starts at $999 for the base model with M1 chip.",
  "do you have any discounts": "We offer seasonal discounts and promotions. Please check our website or visit the store for current offers.",
  "can i pay with cash": "Yes, we accept cash, credit/debit cards, and mobile payments.",
  "do you have a loyalty program": "Yes, we have a loyalty program that offers points for every purchase, which can be redeemed for discounts on future purchases.",
  "do you have a student discount": "Yes, we offer a 10% student discount on select products with valid student ID.",
  "can i pre-order a phone": "Yes, you can pre-order the latest phones. Please check our website for availability and details.",
  "do you have a repair service": "Yes, we provide repair services for phones, laptops, and tablets. Please visit our store for more information.",
  "what is the warranty period for laptops": "Laptops come with a 1-year warranty, with options to extend up to 3 years.",
  "do you have any gaming accessories": "Yes, we have gaming mice, keyboards, headsets, and mouse pads from top brands.",
  "can i buy a phone without a contract": "Yes, we offer unlocked phones that can be purchased without any contract.",
  "do you have a price match policy": "Yes, we offer a price match guarantee. If you find a lower price at a competitor, we will match it."
}
